[
    {
        "title":"Salted Caramel Granola",
        "short_description":"This decadent (but healthy!) salted caramel granola is gluten free and vegan. Best served with homemade nut milk and berries, or just by the handful! ",
        "long_description":"This decadent (but healthy!) salted caramel granola is gluten free and vegan. If you're anything like us, you may already have a bunch of these ingredients in your pantry. You can easily customize granola too, so if you're low on one ingredient, don't worry about heading to the store - you can probably just use something else you have on hand. Easily swap nuts and seeds; don't have walnuts? Use pecans. No almonds? Try cashews. Same goes for seeds - sunflower seeds and pepitas are easily interchangeable.",
        "image":"granola.jpg",
        "ingredients":["¾ cup store-bought or homemade vegan caramel", 
            "3 cups old fashioned rolled oats",
            "¾ cup chopped walnuts",
            "⅓ cup buckwheat groats",
            "⅓ cup sunflower seeds",
            "¼ cup hemp seeds",
            "3 tbsp chia seeds",
            "1 ¼ tsp cinnamon",
            "½ tsp salt",
            "3 tbsp melted coconut oil ",
            "3 tbsp maple syrup",
            "2 tsp vanilla extract",
            "½ cup toasted coconut flakes (unsweetened)",
            "¼ cup cacao nibs"
        ],
        "category":"Breakfast",
        "steps":["Preheat oven to 350 F.",
            "If making caramel homemade, follow these instructions. Let caramel cool slightly before using.",
            "Add all ingredients (except toasted coconut and cacao nibs) to a large bowl and mix until everything is well coated.",
            "Spread onto a parchment paper-lined baking sheet and bake for 45 minutes, stirring every 15 minutes.",
            "In a small bowl, stir together another 2 tablespoon caramel with the cacao nibs and coconut. Stir into granola and bake for another 15 minutes.",
            "Remove from oven and let cool completely before breaking up into clumps. Store in airtight container in pantry for up to 2 weeks."
        ],
        "cooking_time": "45 min",
        "prep_time": "30 min",
        "overall_time": "1 hour 15 min",
        "serves": "8-10 servings"
    },
    {
        "title":"The easiest cold-raised bread rolls",
        "short_description":"The world’s easiest cold-raised bread rolls recipe – without the use of a food mixer.",
        "long_description":"The world’s easiest cold-raised bread rolls recipe – without the use of a food mixer. The dough is very airy, with lots of air holes, so it’s perfect to shape into delicious flutes, too. Enjoy!",
        "image":"bread_rolls.jpg",
        "ingredients":["15 g yeast",
            "700 ml tepid water",
            "900 g all-purpose flour",
            "3 tsp. salt"
        ],
        "category":"Breakfast",
        "steps":["Stir the yeast into the water in a bowl.",
        "Add the flour a little at a time as you stir with a spoon.",
        "Add the salt and the rest of the flour. The dough should be sticky but cohesive. Don’t let it get too dry.",
        "Put cling film over the dough and refrigerate it overnight.",
        "The next day, heat the oven to 250 C convection.",
        "Pour the cold dough onto a floured surface. Sprinkle a little flour on top of the dough and cut the dough into 14-16 pieces (without touching the dough too much).",
        "Place the bread rolls on a baking sheet lined with baking paper and bake the rolls for 16-18 minutes until they have browned a little and become crispy.",
        "Let the bread rolls cool on a rack and then enjoy them!"
    ],
        "cooking_time": "+12 hours",
        "prep_time": "10 min",
        "overall_time": "+12 hours",
        "serves": "14-16 bread rolls"
    },
    {
        "title":"Cucumber And Peach Salad",
        "short_description":"This refreshing Cucumber and peach salad is the perfect intro to Summer! With some prosciutto, feta cheese, and spicy basil dressing it’s a winner!",
        "long_description":"Yay! It’s officially Summer and that’s my favorite season for salads (and cocktails). Eating fresh veggies and fruits topped with a bunch of goodies and a delicious dressing is my Summer jam. This refreshing Cucumber and peach salad is the perfect intro to Summer! With some prosciutto, feta cheese, and spicy basil dressing it’s a winner!",
        "image":"peach_salad.jpg",
        "ingredients":["1 cucumber",
            "1 peach",
            "1/4 cup feta cheese crumbled",
            "2-3 slices prosciutto",
            "1 bunch of basil",
            "1/3 cup oilve oil",
            "juice of 1 lime",
            "½ tsp chili flakes",
            "pinch of salt"
        ],
        "category":"Lunch",
        "steps":["Set a few basil leaves aside and chop the rest.",
            "To make the dressing mx olive oil, lime juice, salt, chili flakes and chopped basil",
            "Cut cucumbers and peaches into ½cm (1/4 inch) slices. Place them into a salad bowl.",
            "Add crumbled feta cheese, prosciutto torn into smaller slices and the basil leaves that you set aside.",
            "Drizzle with the dressing."
        ],
        "cooking_time": "0",
        "prep_time": "10 min",
        "overall_time": "10 min",
        "serves": "2"
    },
    {
        "title":"Badami Paneer",
        "short_description":"A luscious rich curry with paneer chunks in creamy almond gravy, Badami Paneer.",
        "long_description":"Badami Paneer (Almond Cottage Cheese) is a rich curry that takes barely any time to prepare and makes for a great pairing with soft pillow-y naan. I adore the gorgeous orange hue that comes from blending lightly caramelized onions with tomatoes, a common technique I follow quite often with curries.",
        "image":"badami_paneer.jpg",
        "ingredients":["200 gram paneer",
            "¼ cup almonds",
            "1 medium onion (thinly sliced)",
            "1 medium tomato (roughly chopped)",
            "½ inch ginger (grated)",
            "1 teaspoon fennel seeds",
            "2 green cardamoms",
            "4 cloves",
            "½ teaspoon cumin powder",
            "½ teaspoon coriander powder",
            "1 teaspoon turmeric powder",
            "1 teaspoon chili powder",
            "pinch of sugar",
            "fresh coriander (for garnish)",
            "few slivered almonds (for garnish)",
            "salt",
            "oil"
        ],
        "category":"Dinner",
        "steps":["Soak the almonds for a few hours and then peel off the skin.",
            "Cut the paneer into bite size. Then, rub some salt and ½ teaspoon turmeric to the paneer cubes.",
            "Heat some oil in a pan and shallow fry the paneer cubes until they’re golden brown on all the sides. Once done, keep them aside to be used later.",
            "In the same pan, add 1 tablespoon of oil and drop the fennel seeds, cardamom and cloves. Allow it to sizzle and infuse the oil.",
            "Next, drop the garlic and scatter the onion. Sprinkle salt, rest of the turmeric and sugar. Cook until its mild golden in color.",
            "Once done, transfer it to a blender along with tomato and almonds. Grind it to a smooth or coarse paste.",
            "Transfer the paste back to the same pan and give it a stir. Add cumin powder, coriander powder and chili powder. Cook for a few minutes until the raw smell of tomato is gone.",
            "Finally, drop the fried paneer cubes and ½ cup of water. Give it a stir and cook for a couple more minutes. Taste for salt and add any, if required.",
            "Garnish with some finely chopped fresh coriander and slivered almonds."
        ],
        "cooking_time": "35 min",
        "prep_time": "15 min",
        "overall_time": "20 min",
        "serves": "4"
    },
    {
        "title":"Avocado Toast with Soft Boil Egg",
        "short_description":"Avocado Toast with Foolproof Soft Boil Egg.",
        "long_description":"Avocado toast has become such a thing in the breakfast world. I get why, and I'm a total fan. It's meat is soft and fatty, making an excellent blanket for a bare piece of toast. It's unequivocally nutritious, and relatively inexpensive given its main role in this dish. I added an egg, because protein is key for satiety. I also make a point to sprinkle chili flakes, generously. She brought it to my attention and it truly is a must. Overall, this combo is what I eat many mornings and it powers me through until the late afternoon. I could eat for any meal and every meal. At a meager $3 a serving, it's economical, quick, easy, delicious, and filling.",
        "image":"avocado_toast.jpeg",
        "ingredients":["1 egg",
       "2 slices of bread", 
        "1 avocado",
        "1/4-1/2 teaspoon chili flakes",
        "salt and pepper",
        "chopped parsley, for garnish"
        ],
        "category":"Breakfast",
        "steps":["Fill a medium sized saucepan halfway with water. Cover and bring to a boil over medium high.", 
        "Carefully place each egg in the saucepan using a spoon, being careful not to drop it abruptly as it could crack the shell.",
        "Cook, uncovered, exactly 6 minutes.",
        "Once the timer goes off, drain the boiling water and run the eggs under cold water to stop the cooking process. Let cool and peel.",
        "Using a fork or the back of a spoon, mash the avocado thoroughly.",
        "Spread all over the toast, making sure you're covering every edge.",
        "Sprinkle some salt, pepper and chili flakes.",
        "Top with the soft boil egg, a pinch of chopped parsley and enjoy your breakfast."
        ],
        "cooking_time": "6 min",
        "prep_time": "6 min",
        "overall_time": "12 min",
        "serves": "1"
    },
    {
        "title":"Heirloom BLT with Pesto",
        "short_description":"Who doesn’t love eggs and bacon for every meal? Or in this case a heavenly bacon, lettuce and tomato sandwich oozing with warm basil pesto and bright yellow egg yolk.",
        "long_description":"All the usual dinner food groups are represented—protein and veggies, piled between crusty bread—so you can serve this seasonal sandwich to your family or guests without guilt of any kind. While any fresh, ripe tomato can replace the heirloom variety in the recipe, we suggest you gobble up as many heirlooms you can get your hands on while they are still in your gardens, or local farmers markets. You won’t be sorry.",
        "image":"blt.jpg",
        "ingredients":["8 slices ciabatta bread",
        "1/4 cup mayonnaise",
        "1/2 cup homemade basil pesto",
        "8 oz apple wood bacon, cooked",
        "2 cups arugula",
        "1 large heirloom tomato, sliced",
        "4 eggs"
        ],
        "category":"Lunch",
        "steps":["To assemble the sandwiches, place bread under an oven’s broiler for 1 minute to get some nice, brown, toasty color and crunch.",
        "On the soft side of one slice of the bread/toast, spread 1 tablespoon mayonnaise. On the other slice of bread, spread 2 tablespoons pesto.",
        "Layer on the bacon, arugula, and tomato.",
        "Fry eggs to desired yolk runniness. Place one egg on each sandwich and enjoy."
        ],
        "cooking_time": "20 min",
        "prep_time": "15 min",
        "overall_time": "35 min",
        "serves": "4" 
    },
    {
        "title":"Pad See Ew",
        "short_description":"Pad See Ew is popular Thai stir-fried rice noodles with meat, eggs, Chinese broccoli, soy sauce and other seasonings.",
        "long_description":"The stir-fried noodles we are talking about here are the flat rice noodle or what we normally called kuey tiao/kwe tiau in Indonesia, Malaysia and Singapore. In Thailand, pad see ew is their version of char kwe tiau. The dish gets it name from the ingredient use in making this stir-fry, soy sauce, si-io (conveniently spelled into si ew) means soy sauce.",
        "image":"pad-see-ew.jpg",
        "ingredients":["1 lbs fresh/dried flat rice noodles",
       " 4 Tbsp cooking oil divided",
        "2 eggs",
        "3 garlic cloves finely chopped",
        "6 oz pork loin or meat of your choice",
        "5 stalks of Chinese broccoli/ kai lan",
        "1 tsp cornstarch",
        "1 tsp soy sauce",
        "1 tsp dark soy sauce",
        "2 Tbsp dark soy sauce",
        "2 Tbsp regular/light soy sauce add more to your taste as needed",
        "1 Tbsp oyster sauce",
        "¼ tsp white pepper powder"
        ],
        "category":"Dinner",
        "steps":["If using dried rice noodles, soak in water for at least 2 hours.",
        "If you are using refrigerated sheets of rice noodles, they come in one large sheet or pre-cut. Microwave them for about 1 minute and then cut (if you need to) and then separate and loosen the noodle.",
        "Marinate the pork slices with marinade for meat ingredients for 30 minutes and prepare other things while waiting",
        "Separate the big stalks from the leaves of Chinese broccoli. Slice the stems diagonally into 1/2-inch piece",
        "Preheat your wok on a high heat until it is really really hot. Add cooking oil",
        "Crack in the eggs and let them fry a little bit, for about 10 seconds and then stir it around to break it up a little bit, but not too much.",
        "Push it to the side and add the pork slices and garlic and stir-fry until the pork turn color and cooked through, about 20-30 seconds.",
        "Dish everything out to avoid overcooking the pork and egg.",
        "Add the vegetables and stir-fry until it started to wilt but still fresh green and slightly crunchy",
        "Wipe the wok clean and bring it back up to high heat. Add cooking oil.",
        "Add the stems of the Chinese broccoli you cut earlier and stir fry for about 2 minutes.",
        "Add the noodles, the seasonings and stir fry to make sure the noodles pick up the seasonings. The noodles will start to soften (may take a bit longer for dry noodles).",
        "Add the egg and pork back into the wok. Stir to mix everything. Have a taste and add more soy sauce if necessary.",
        "Transfer immediately to a serving plate and serve immediately"
        ],
        "cooking_time": "30 min",
        "prep_time": "2 hours",
        "overall_time": "2 hours 30 min",
        "serves": "2" 
    },
    {
        "title":"Salted caramel ice cream",
        "short_description":"Salted caramel ice cream – a recipe for the creamiest ice cream with salted caramel using only 3 ingredients.",
        "long_description":"Salted caramel ice cream – a recipe for the creamiest ice cream with salted caramel using only 3 ingredients. No ice cream machine needed!",
        "image":"icecream.jpg",
        "ingredients":["1 L cream",
            "1 tin condensed milk",
            "1 tin dulce de leche mixed with 1 tsp. sea salt"
        ],
        "category":"Dessert",
        "steps":["Whisk the cream and condensed milk together into a lightly whipped cream.",
        "Line a form with baking paper (or put the ice cream in a container).",
        "Spread half of the ice cream in the mold and spread the dulce de leche on top.",
        "Make another layer and place the ice cream in the freezer for 4-6 hours.",
        "Enjoy!"
        ],
        "cooking_time": "+6 hours",
        "prep_time": "10 min",
        "overall_time": "+6 hours",
        "serves": "6-8" 
    },
    {
        "title":"Healthy snickers bars",
        "short_description":"Delicious healthy snickers bars that are really easy to make.",
        "long_description":"Delicious healthy snickers bars that are really easy to make. They consist of a date base with salted peanuts and oatmeal, covered in a thick layer of dark chocolate with more peanuts. I’ve made healthy snacks inspired by snickers before. These snickers truffles are basically made with the same ingredients as snickers bars. They’re perfect to enjoy as a snack and I will definitely be making these again when I go on a skiing holiday with my family next week. Enjoy!",
        "image":"snickers.jpg",
        "ingredients":["250 g dates, juicy",
        "100 g peanuts, salted",
        "50 g oatmeal",
        "2 tbsp. coconut oil",
        "150 g dark chocolate, I used 80%",
        "3 tbsp. coconut oil",
        "50 g peanuts"
        ],
        "category":"Snacks",
        "steps":["Blend all the ingredients together into a uniform and cohesive mixture.",
        "Line a bread tin with cling film and press the mixture down into the bottom until it is evenly spread out.",
        "Refrigerate for 1 hour.",
        "Melt the chocolate and coconut oil in a bain marie and stir well.",
        "Pour the chocolate over the date mixture and sprinkle it with peanuts.",
        "Refrigerate until the chocolate has set.",
        "Cut into bars and serve (They can be a little difficult to cut, so turn the bars over so you cut into the date mixture first and then the chocolate).",
        "Keep the bars in an airtight container in the fridge.",
        "Enjoy!"
        ],
        "cooking_time": "1 hour",
        "prep_time": "15 min",
        "overall_time": "+1 hour",
        "serves": "8-10" 
    }
]   